TestCase/OneraM6/simulation/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|    HiSA: High Speed Aerodynamic solver                                      |
|    Copyright (C) 2014-2017 Johan Heyns - CSIR, South Africa                 |
|    Copyright (C) 2014-2017 Oliver Oxtoby - CSIR, South Africa               |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application       hisa;

startFrom         latestTime;

startTime         0;

stopAt            endTime;

endTime           16000;

deltaT            1;

writeControl      timeStep;

writeInterval    1000;

purgeWrite        4;

writeFormat       ascii;

writePrecision    6;

writeCompression  off;

timeFormat        general;

timePrecision     6;

graphFormat       raw;

runTimeModifiable yes;


// ************************************************************************* //
