TestCase/OneraM6/simulation/0/p
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|    HiSA: High Speed Aerodynamic solver                                      |
|    Copyright (C) 2014-2017 Johan Heyns - CSIR, South Africa                 |
|    Copyright (C) 2014-2017 Oliver Oxtoby - CSIR, South Africa               |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           volScalarField;
    object          p;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/freestreamConditions"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $p;

boundaryField
{
    wing
    {
        type            characteristicWallPressure;
        value           $internalField;
    }
    "(farfield)"
    {
        type            characteristicFarfieldPressure;
        #include        "include/freestreamConditions"
        value           $internalField;
    }
    "(symm)"
    {
        type            symmetry;
        value           $internalField;
    }

    "(intPatch)"
    {
       type            zeroGradient;
    }
}


// ************************************************************************* //
