TestCase/OneraM6/simulation/0/V
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];


internalField   nonuniform List<scalar> 
294912
(
0.722181
0.487903
0.717266
0.619947
0.32695
0.487273
0.421748
0.712241
...
)
;

boundaryField
{
    intPatch
    {
        type            calculated;
        value           nonuniform List<scalar> 0();
    }
    wing
    {
        type            calculated;
        value           uniform 0;
    }
    symm
    {
        type            symmetry;
    }
    farfield
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
