TestCase/OneraM6/simulation/0/include/freestreamConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

U             ( 290.58 30.53 0.0 );
p             80510.081;
T             300;
#inputMode    merge

// ************************************************************************* //
